easy_questions = ("Ποια ήταν η πρωτεύουσα της αρχαίας Ελλάδας;:",
                  "Ποιος ήταν ο ιστορικός που περιέγραψε την κατάκτηση της Τροίας στην Ιλιάδα;:",
                  "Ποιος είναι ο συνθέτης του εθνικού ύμνου της Ελλάδας;:",
                  "Ποια είναι η γνωστή ελληνική γιορτή του καλοκαιριού που γιορτάζεται στις 15 Αυγούστου;:",
                  "Πότε γιορτάζετε η ενάρξη της Ελληνικής επανάστασης;:",
                  "Ποιο είναι το μεγαλύτερο νησί της Ελλάδας;",
                  "Ποιο είναι το ακρωτήριο όπου βρίσκεται ο ναός του Ποσειδώνα;",
                  "Ποιο έργο του Ευριπίδη περιγράφει την τραγική ιστορία της Αντιγόνης;")

medium_questions = ("Ποιο είναι το εθνικό ζώο της Ελλάδας;:",
                    "Ποια είναι η διάσημη ελληνίδα τραγουδίστρια που κατέκτησε τη Eurovision το 2005;:",
                    "Ποια είναι η πόλη-κράτος που διακρίθηκε για την αρχιτεκτονική της που συνδυάζει φυσικό τοπίο και αρχαία μνημεία;",
                    "Ποιος αρχαίος ελληνικός φιλόσοφος είναι γνωστός για την πρότασή του Γνώθι σε αυτόν",
                    "Ποιος ήταν ο αρχαίος Έλληνας ιατρός που θεωρείται ο πατέρας της ιατρικής;")

hard_questions = ("Σύμφωνα με τον μύθο ποιος ξεκίνησε τους Ολυμπιακους αγώνες;:",
                  "Ποιος ήταν ο διάσημος αρχαίος Έλληνας ζωγράφος που ζωγράφισε τα τοιχογραφικά τους τάματα στην πόλη της Πομπηίας;:",
                  "Ποιο ήταν το κοινό θέμα των περισσότερων αρχαίων ελληνικών κεραμικών;",
                  "Ποιος είναι ο διάσημος μαθηματικός και φυσικός που γεννήθηκε στην Ελλάδα και έζησε στον 3ο αιώνα π.Χ.;",
                  "Ποιο είναι το αρχιτεκτονικό θαύμα στην Πελοπόννησο που κατασκευάστηκε τον 20ό αιώνα;",
                  "Ποιος αρχαίος Έλληνας μαθηματικός θεωρείται ο πατέρας της γεωμετρίας",
                  "Ποιο ήταν το έργο του Αισχύλου που περιγράφει την επιστροφή του Αγαμέμνονα στην Αργό;")

easy_options = (("A. Ναύπλιο", "B. Σπάρτη", "C. Αθήνα", "D.Χανία"),
                ("A. Δημοσθένης", "B. Θουκυδίδης", "C. Ηρόδοτος", "D. Όμηρος"),
                ("A. Διονύσιος Σολώμος", "B. Μίκης Θεοδοράκης", "C. Μάνος Χατζιδάκις", "D. Νίκος Σκαλκώτας"),
                ("A. Αγίου Πνεύματος", "B. Κοίμηση της Θεοτόκου", "C. Αγίων Πάντων", "D. Αγίου Ιωάννη"),
                ("A. 12 Απριλίου", "B. 25 Μαρτίου", "C. 7  Ιουλίου", "D. 1 Ιουλίου"),
                ("A. Κρήτη","B. Ρόδος","C. Ευβοία","D. Μυτιλήνη"),
                ("A. Ταίναρο","B. Δράστης","C. Καβογκρεκό","D. Σούνιο"),
                ("A. Αντιγόνη","B. Μηδεία","C. Ηλέκτρα","D. Άλκηστη"))

medium_options = (("A. Γάτα", "B. Σκίουρος", "C. Δελφίνι", "D. Αρκούδα"),
                  ("A. Άννα Βίσση", "B. Έλενα Παπαρίζου", "C. Ελένη Φουρέιρα", "D. Καλομίρα"),
                  ("A. Πάτρα", "B. Χανία", "C. Αθήνα", "D. Σαντορίνη"),
                  ("A. Σωκράτης", "B. Πλάτωνας", "C. Αριστοτέλης", "D. Ηράκλειτος"),
                  ("A. Γαληνός", "B. Ασκληπιάδες", "C. Ηρόδοτος", "D. Ιπποκράτης"),
                  ("A.","B.","C.","D."),
                  ("A.","B.","C.","D."))

hard_options = (("A. Δίας", "B. Άρης", "C. Ηρακλής", "D. Θησέας"),
                ("A. Ζεύξις", "B. Εφήβιος", "C. Φίλοξενος", "D. Πολύγνωτος"),
                ("A. Αθλήματα", "B. Σκηνές καθημερινής ζωής ", "C. Έρωτας", "D. Απεικόνιση των μύθων της ελληνικής μυθολογίας"),
                ("A. Θάλης", "B. Πυθαγόρας", "C. Αρχιμήδης", "D. Ευκλείδης"),
                ("A. Αρχαίο θέατρο της Κορίνθου", "B. Οι Μετεώροι", "C. Οι μεσαιωνικές και βυζαντινές εκκλησίες στη Μονεμβασιά", "D. Αρχαίο θέατρο της Επιδαύρου"),
                ("A. Πυθαγόρας","B. Θαλής","C. Αρχιμήδης","D. Ευκλείδης"),
                ("A. Πέρσες","B. Ορέστεια","C. Ευμενίδες","D. Χοηφόρο"))

easy_answers = ("A", "D", "A", "B", "B","A","D","A")
medium_answers = ("C", "B", "D", "A", "D")
hard_answers = ("C", "C", "D", "A", "D")
guesses = []
score = 0
money = 0
question_num = 0

reward_per_question = {
    1: 50,
    2: 100,
    3: 150,
    4: 250,
    5: 500,
    6: 1000,
    7: 2000,
    8: 4000,
    9: 5000,
    10: 10000,
    11: 20000,
    12: 100000
}


def get_questions():
    return easy_questions, medium_questions, hard_questions

def get_options(question):
    if question in easy_questions:
        return easy_options[easy_questions.index(question)]
    elif question in medium_questions:
        return medium_options[medium_questions.index(question)]
    else:
        return hard_options[hard_questions.index(question)]
    
def get_answers(question):
    easy_answers = {
        "Ποια ήταν η πρωτεύουσα της αρχαίας Ελλάδας;:": "A. Ναύπλιο",
        "Ποιος ήταν ο ιστορικός που περιέγραψε την κατάκτηση της Τροίας στην Ιλιάδα;:": "D. Όμηρος",
        "Ποιος είναι ο συνθέτης του εθνικού ύμνου της Ελλάδας;:": "A. Διονύσιος Σολώμος",
        "Ποια είναι η γνωστή ελληνική γιορτή του καλοκαιριού που γιορτάζεται στις 15 Αυγούστου;:": "B. Κοίμηση της Θεοτόκου",
        "Πότε γιορτάζετε η ενάρξη της Ελληνικής επανάστασης;:": "B. 25 Μαρτίου",
        "Ποιο είναι το μεγαλύτερο νησί της Ελλάδας;": "A. Κρήτη",
        "Ποιο είναι το ακρωτήριο όπου βρίσκεται ο ναός του Ποσειδώνα;": "D. Σούνιο",
        "Ποιο έργο του Ευριπίδη περιγράφει την τραγική ιστορία της Αντιγόνης;": "A. Αντιγόνη"
    }
    medium_answers = {
        "Ποιο είναι το εθνικό ζώο της Ελλάδας;:": "C. Δελφίνι",
        "Ποια είναι η διάσημη ελληνίδα τραγουδίστρια που κατέκτησε τη Eurovision το 2005;:": "B. Έλενα Παπαρίζου",
        "Ποια είναι η πόλη-κράτος που διακρίθηκε για την αρχιτεκτονική της που συνδυάζει φυσικό τοπίο και αρχαία μνημεία;": "D. Σαντορίνη",
        "Ποιος αρχαίος ελληνικός φιλόσοφος είναι γνωστός για την πρότασή του Γνώθι σε αυτόν": "A. Σωκράτης",
        "Ποιος ήταν ο αρχαίος Έλληνας ιατρός που θεωρείται ο πατέρας της ιατρικής;": "D. Ιπποκράτης"
    }
    hard_answers = {
        "Σύμφωνα με τον μύθο ποιος ξεκίνησε τους Ολυμπιακους αγώνες;:":"C. Ηρακλής",
        "Ποιος ήταν ο διάσημος αρχαίος Έλληνας ζωγράφος που ζωγράφισε τα τοιχογραφικά τους τάματα στην πόλη της Πομπηίας;:": "C. Φίλοξενος",
        "Ποιο ήταν το κοινό θέμα των περισσότερων αρχαίων ελληνικών κεραμικών;": "D. Απεικόνιση των μύθων της ελληνικής μυθολογίας",
        "Ποιος είναι ο διάσημος μαθηματικός και φυσικός που γεννήθηκε στην Ελλάδα και έζησε στον 3ο αιώνα π.Χ.;": "B. Πυθαγόρας",
        "Ποιο είναι το αρχιτεκτονικό θαύμα στην Πελοπόννησο που κατασκευάστηκε τον 20ό αιώνα;": "C. Οι μεσαιωνικές και βυζαντινές εκκλησίες στη Μονεμβασιά",
        "Ποιος αρχαίος Έλληνας μαθηματικός θεωρείται ο πατέρας της γεωμετρίας": "B. Θαλής",
        "Ποιο ήταν το έργο του Αισχύλου που περιγράφει την επιστροφή του Αγαμέμνονα στην Αργό;": "B. Ορέστεια"
    }

    if question in easy_answers:
        return easy_answers[question]
    elif question in medium_answers:
        return medium_answers[question]
    elif question in hard_answers:
        return hard_answers[question]
    else:
        return None
